# GetElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..GetElements Method
AnalysisDisplayStyle Class See Also
---
Returns set of all analysis display styles elements in the given document.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ICollection<ElementId> GetElements(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetElements ( _
	document As Document _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetElements(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document from which analysis display style elements are retrieved.
# ### Return Value
All analysis display style elements existing in the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace